/********************************
 * 유니티 메인 창
 ********************************/

// <프로젝트 창>
// 프로젝트와 관련된 모든 파일을 표시하는 창
// 프로젝트에 필요한 에셋과 패키지를 관리하는 창
// 에셋 : 개발에 사용할 모든 형태의 파일(이미지, 음악, 3D 모델, 등)
// 패키지 : 유니티에서 제공하는 기능 묶음으로 필요한 기능을 패키지매니저를 통해서 포함 가능


// <씬 창>
// 유니티에서 하나의 게임 월드를 뜻하는 씬을 편집하는 창
// 씬에 존재하는 게임오브젝트를 시각화하고 상호작용으로 편집
// 플라이스루 모드 : 마우스 우클릭으로 활성화, 씬 창을 1인칭 시점으로 탐색 가능
// 씬 편집 툴 : 씬 창에서 게임오브젝트를 편집할 때 사용하는 툴
// 기즈모 : 씬 창에서만 표현되는 상호작용 도구로 씬 편집을 도움, 게임 창에서는 표현되지 않음
// 씬 기즈모 : 씬 창 카메라의 현재 방향을 표시하며 방향과 투사모드를 변경 가능


// <게임 창>
// 플레이어가 실제로 보게 될 화면을 표시하는 창
// 게임의 카메라 게임오브젝트가 보고 있는 영역이 그려짐
// 플레이 모드 : 프로젝트를 실행하고 게임이 어떻게 동작하는지 확인할 수 있도록 함


// <하이어라키 창>
// 씬에 존재하는 모든 게임오브젝트가 나열되는 창
// 씬에 필요한 게임오브젝트들을 추가하거나 삭제
// 씬에 사용할 게임오브젝트를 정렬하고 그룹화하며 부모-자식 관계를 지정


// <인스펙터 창>
// 현재 선택한 게임오브젝트의 정보를 표시하고 변경할 수 있는 창
// 현재 선택한 게임오브젝트의 이름, 활성화, 태그, 레이어, 등을 표시
// 현재 선택한 게임오브젝트에 추가한 컴포넌트가 모두 표시


// <콘솔 창>
// 유니티가 기록(로그)을 남겨 개발자에게 정보를 전달하는 창
// 게임이 진행되는 중 개발자에게 텍스트 형식으로 정보를 전달
// 로그의 종류에 따라 정보, 경고, 오류로 구분할 수 있음