using UnityEngine;

namespace Unity
{
    public class UnityComponent : MonoBehaviour
    {
        /**********************************************************
         * 컴포넌트 (Component)
         * 
         * 특정한 기능을 수행할 수 있도록 구성한 작은 기능적 단위
         * 게임오브젝트의 작동과 관련한 부품
         * 게임오브젝트에 추가, 삭제하는 방식의 조립형 부품
         **********************************************************/



        /********************************************************************************
         * MonoBehaviour
         * 
         * 컴포넌트가 기본클래스로 하는 클래스로 유니티 스크립트가 파생되는 기본 클래스
         * 게임오브젝트에 스크립트를 컴포넌트로서 연결할 수 있는 구성을 제공
         ********************************************************************************/
    }
}