using UnityEngine;

namespace Unity
{
    public class UnityAudio : MonoBehaviour
    {
        /***************************************************
         * 오디오 (Audio)
         * 
         * 게임월드에서 플레이어에게 들려주는 청각적인 요소
         ***************************************************/

        // <Audio Component>
        // Audio Listener : 씬에서 주어진 오디오 소스로부터의 입력을 수신
        //                  주로 씬에서 카메라에 부착되어 있으며, 하나만 유지시킴
        // Audio Source : 씬에서 오디오 클립을 재생
        //                오디오 클립을 재생하기 위한 다양한 오디오효과를 적용할 수 있음


        // <Audio Mixer>
        // 다양한 오디오 소스 믹스, 효과 적용 및 마스터링 작업진행
        // 오디오의 그룹을 나누어 여러 효과를 적용하고 최종적으로 합치는 작업을 진행
        // Exposed Parameter : 오디오믹서의 내용을 스크립트 상에서 편집하기 위해 등록한 구성
    }
}